ygoz/stm32h723zg_mg_rtos/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "string.h"
#include "cmsis_os.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "mongoose.h"
#include "stm32h7xx_hal.h"
#include "http/routers/main_router.h"
#include "http/settings/network.h"
#include "serial_comm/i2c/hi2c4.h"
#include "peripherals/adc/hadc3.h"
#include "peripherals/adc/hadc2.h"
#include "peripherals/adc/utils.h"
#include "peripherals/dac/hdac1.h"
#include "peripherals/dts/hdts.h"
#include "peripherals/comp/hcomp1.h"
#include "serial_comm/uart/huart10.h"
#include "serial_comm/uart/huart8.h"
#include "peripherals/timer/htim8.h"
#include "serial_comm/spi/hspi4.h"
#include "serial_comm/spi/hspi5.h"
#include "serial_comm/spi/octospi.h"
#include "flash/w25q128jvsq.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
#if defined ( __ICCARM__ ) /*!< IAR Compiler */
#pragma location=0x30000000
ETH_DMADescTypeDef  DMARxDscrTab[ETH_RX_DESC_CNT]; /* Ethernet Rx DMA Descriptors */
#pragma location=0x30000080
ETH_DMADescTypeDef  DMATxDscrTab[ETH_TX_DESC_CNT]; /* Ethernet Tx DMA Descriptors */

#elif defined ( __CC_ARM )  /* MDK ARM Compiler */

__attribute__((at(0x30000000))) ETH_DMADescTypeDef  DMARxDscrTab[ETH_RX_DESC_CNT]; /* Ethernet Rx DMA Descriptors */
__attribute__((at(0x30000080))) ETH_DMADescTypeDef  DMATxDscrTab[ETH_TX_DESC_CNT]; /* Ethernet Tx DMA Descriptors */

#elif defined ( __GNUC__ ) /* GNU Compiler */

ETH_DMADescTypeDef DMARxDscrTab[ETH_RX_DESC_CNT] __attribute__((section(".RxDescripSection"))); /* Ethernet Rx DMA Descriptors */
ETH_DMADescTypeDef DMATxDscrTab[ETH_TX_DESC_CNT] __attribute__((section(".TxDescripSection")));   /* Ethernet Tx DMA Descriptors */
#endif

ETH_TxPacketConfig TxConfig;


ETH_HandleTypeDef heth;

RNG_HandleTypeDef hrng;

UART_HandleTypeDef huart3;

/* Definitions for Server */
osThreadId_t ServerHandle;
const osThreadAttr_t Server_attributes = {
  .name = "Server",
  .stack_size = 2048 * 4,
  .priority = (osPriority_t) osPriorityNormal,
};
/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_ETH_Init(void);
static void MX_RNG_Init(void);
void server(void *argument);

/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

//  try to move to syscalls.c 
// int _write(int fd, unsigned char *buf, int len) {
//   if (fd == 1 || fd == 2) {                     // stdout or stderr ?
//     HAL_UART_Transmit(&huart3, buf, len, 999);  // Print to the UART
//   }
//   return len;
// }


// In RTOS environment, run this function in a separate task. Give it 8k stack
static void run_mongoose(void) {
  struct mg_mgr mgr = {0};        // Mongoose event manager
  mg_mgr_init(&mgr);        // Initialise event manager


  mg_http_listen(&mgr, "http://0.0.0.0:80", event_handler, "");
  set_ip_configurations(&mgr);


  mg_log_set(MG_LL_DEBUG);  // Set log level to debug
//  HAL_GPIO_WritePin(GPIOB, LED_GREEN_Pin, GPIO_PIN_SET);
  // HAL_GPIO_WritePin(LED_YELLOW_GPIO_Port, LED_YELLOW_Pin, GPIO_PIN_SET);
  HAL_GPIO_WritePin(LED_RED_GPIO_Port, LED_RED_Pin, GPIO_PIN_SET);

  for (;;) {                // Infinite event loop
    mg_mgr_poll(&mgr, 10);   // Process network events
  }
}


#include "stm32h7xx_hal.h"  // or your MCU-specific HAL
#include <stm32h7xx_hal_ospi.h>

// extern OSPI_HandleTypeDef hospi2;  // Your OCTOSPI/QSPI handle

// uint8_t W25Q_ReadStatusRegister1(void)
// {
//     OSPI_RegularCmdTypeDef sCommand = {0};
//     uint8_t reg = 0;

//     // 0x05 = Read Status Register-1
//     sCommand.OperationType      = HAL_OSPI_OPTYPE_COMMON_CFG;
//     sCommand.FlashId            = HAL_OSPI_FLASH_ID_1;
//     sCommand.Instruction        = 0x05; // input the reg definition
//     sCommand.InstructionMode    = HAL_OSPI_INSTRUCTION_1_LINE;
//     sCommand.AddressMode        = HAL_OSPI_ADDRESS_NONE;
//     sCommand.DataMode           = HAL_OSPI_DATA_1_LINE;
//     sCommand.DummyCycles        = 0;
//     sCommand.InstructionSize    = HAL_OSPI_INSTRUCTION_8_BITS;
//     sCommand.NbData             = 1;

//     // Send the command
//     if (HAL_OSPI_Command(&hospi2, &sCommand, HAL_OSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
//         return 0xFF;

//     // Receive the data
//     if (HAL_OSPI_Receive(&hospi2, &reg, HAL_OSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
//         return 0xFF;

//     return reg;
// }

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */
  SCB_EnableICache();
  // SCB_EnableDCache();

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

