ygoz/stm32h723zg_mg_rtos/Core/Src/main.c
  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_ETH_Init();
  MX_RNG_Init();
  /* USER CODE BEGIN 2 */
  // MX_OCTOSPI2_Init();

  //init all adcs here + calibration
  adc_init_all_handles();

  //init comp
  uint32_t comp_output;
  comp1_get_value(&comp_output);

  //init uart
  uart10.init(&uart10);
  uart8.init(&uart8);

  // **************************SPI***************************************
  // uint8_t *spi_rx;
  // uint8_t spi_tx[10] = "shalom aa";

  // const uint32_t test_addr = 0x000000;  // Must be sector-aligned (multiple of 4096)
  //   const char *test_data = "Hello from shalom Flash!";
  //   uint8_t read_buf[64] = {0};

  //   // 1. Erase sector
  //   if (my_flash.erase_sector(&my_flash, test_addr) != HAL_OK) {
  //       printf("Flash erase failed!\r\n");
  //       return;
  //   }

  //   // 2. Write string to flash
  //   if (my_flash.write_page(&my_flash, test_addr, (uint8_t *)test_data, strlen(test_data)) != HAL_OK) {
  //       printf("Flash write failed!\r\n");
  //       return;
  //   }

  //   // 3. Read back the string
  //   if (my_flash.read(&my_flash, test_addr, read_buf, strlen(test_data)) != HAL_OK) {
  //       printf("Flash read failed!\r\n");
  //       return;
  //   }

  //   // 4. Print result
  //   printf("Flash read: %s\r\n", read_buf);

// **************************************************QSPI*********************************************
// uint8_t write_data[] = "Hello";
// uint8_t *actual_write = write_data;
//     uint8_t read_data[sizeof(write_data)] = {0};
//     uint32_t address = 0x000000;

//     // Init + Reset + Config
//     W25Q128_OCTO_SPI_Init(&hospi2);

//     // Erase sector
//     W25Q128_OSPI_Erase_Chip(&hospi2);
//     if (W25Q128_OSPI_EraseSector(&hospi2, address, address + 4095) != HAL_OK) return;

//   // W25Q128_OSPI_WriteEnable(&hospi2);

// //     uint8_t status_reg = W25Q_ReadStatusRegister1();
// // printf("status_reg: 0x%02X\n", status_reg);

// // Check WEL (bit 1) and BUSY (bit 0)
// // if (status_reg & 0x01) printf("BUSY: Write/Erase in progress\n");
// // if (status_reg & 0x02) printf("WEL: Write Enable Latch is set\n");

//     // Write
//     if (W25Q128_OSPI_Write(&hospi2, write_data, address, sizeof(write_data)) != HAL_OK) return;


// // status_reg = W25Q_ReadStatusRegister1();
// // printf("status_reg: 0x%02X\n", status_reg);

// // Check WEL (bit 1) and BUSY (bit 0)
// // if (status_reg & 0x01) printf("BUSY: Write/Erase in progress\n");
// // if (status_reg & 0x02) printf("WEL: Write Enable Latch is set\n");


//     // Read
//     if (W25Q128_OSPI_Read(&hospi2, read_data, address, sizeof(read_data)) != HAL_OK) return;

//     // Output
//     printf("Read: %s\r\n", read_data);
// // Read data
//     if (W25Q128_OSPI_EnableMemoryMappedMode(&hospi2) != HAL_OK) return;

//     volatile uint8_t *ptr = (uint8_t *)0x70000000;
//     printf("First 100 bytes at 0x70000000 (hex):\r\n");
//     for (int i = 0; i < 100; i++) {
  //         printf("%02X ", ptr[i]);
  //         if ((i + 1) % 16 == 0) printf("\r\n");
  //     }
// **************************************************QSPI*********************************************

  /* USER CODE END 2 */

  /* Init scheduler */
  osKernelInitialize();

  /* USER CODE BEGIN RTOS_MUTEX */
  /* add mutexes, ... */
  /* USER CODE END RTOS_MUTEX */

  /* USER CODE BEGIN RTOS_SEMAPHORES */
  /* add semaphores, ... */
  /* USER CODE END RTOS_SEMAPHORES */

  /* USER CODE BEGIN RTOS_TIMERS */
  /* start timers, add new ones, ... */
  /* USER CODE END RTOS_TIMERS */

  /* USER CODE BEGIN RTOS_QUEUES */
  /* add queues, ... */
  /* USER CODE END RTOS_QUEUES */

  /* Create the thread(s) */
  /* creation of Server */
  ServerHandle = osThreadNew(server, NULL, &Server_attributes);

  /* USER CODE BEGIN RTOS_THREADS */
  /* add threads, ... */
  /* USER CODE END RTOS_THREADS */

  /* USER CODE BEGIN RTOS_EVENTS */
  /* add events, ... */
  /* USER CODE END RTOS_EVENTS */

  /* Start scheduler */
  osKernelStart();

  /* We should never get here as control is now taken by the scheduler */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */

  while (1) {
    printf("Tick: %lu\r\n", HAL_GetTick());
    HAL_Delay(500);
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Supply configuration update enable
  */
  HAL_PWREx_ConfigSupply(PWR_LDO_SUPPLY);

  /** Configure the main internal regulator output voltage
  */
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE0);

  while(!__HAL_PWR_GET_FLAG(PWR_FLAG_VOSRDY)) {}

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI48|RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_DIV1;
  RCC_OscInitStruct.HSICalibrationValue = 64;
  RCC_OscInitStruct.HSI48State = RCC_HSI48_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
  RCC_OscInitStruct.PLL.PLLM = 4;
  RCC_OscInitStruct.PLL.PLLN = 34;
  RCC_OscInitStruct.PLL.PLLP = 1;
  RCC_OscInitStruct.PLL.PLLQ = 4;
  RCC_OscInitStruct.PLL.PLLR = 2;
  RCC_OscInitStruct.PLL.PLLRGE = RCC_PLL1VCIRANGE_3;
  RCC_OscInitStruct.PLL.PLLVCOSEL = RCC_PLL1VCOWIDE;
  RCC_OscInitStruct.PLL.PLLFRACN = 3072;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2
                              |RCC_CLOCKTYPE_D3PCLK1|RCC_CLOCKTYPE_D1PCLK1;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.SYSCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB3CLKDivider = RCC_APB3_DIV2;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_APB1_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_APB2_DIV2;
  RCC_ClkInitStruct.APB4CLKDivider = RCC_APB4_DIV2;

